CREATE TABLE `pmslist` (
                           `PMS_SEQ` int NOT NULL AUTO_INCREMENT,
                           `PMS_NO` varchar(100) DEFAULT NULL,
                           `DEPTH1` varchar(100) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci DEFAULT '' COMMENT '1레벨',
                           `DEPTH2` varchar(100) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci DEFAULT '' COMMENT '2레벨',
                           `DEPTH3` varchar(100) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci DEFAULT '' COMMENT '3레벨',
                           `PMS_DESC` varchar(200) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci DEFAULT '' COMMENT '설명',
                           `STRT_DATE` varchar(8) DEFAULT NULL COMMENT '시작일',
                           `END_DATE` varchar(8) DEFAULT NULL COMMENT '종료일',
                           `PROC_RATE` varchar(3) DEFAULT '',
                           PRIMARY KEY (`PMS_SEQ`)
) ENGINE=InnoDB AUTO_INCREMENT=64 DEFAULT CHARSET=utf8mb3;


INSERT INTO REACT.PMSLIST (PMS_NO,DEPTH1,DEPTH2,DEPTH3,PMS_DESC,STRT_DATE,END_DATE,PROC_RATE) VALUES
                                                                                                  ('25','디자인','웹 디자인 개발','','로그인 및 대시보드 디자인 개발','20221128','20230205','90'),
                                                                                                  ('25','디자인','모바일 디자인 개발','','모바일 디자인 개발','20230201','20230218','0'),
                                                                                                  ('25','퍼블리싱','웹 퍼블리싱','','웹퍼블','20221128','20230215','50'),
                                                                                                  ('25','퍼블리싱','모바일 퍼블리싱','','모바일퍼블','20230219','20230228','0'),
                                                                                                  ('25','환경설정','프레임워크 개발','','스프링부트, 타임리프 기반 프레임워크 개발','20221201','20221206','100'),
                                                                                                  ('25','환경설정','샘플소스 작성','','화면 샘플소스 개발','20221206','20221230','90'),
                                                                                                  ('25','환경설정','개발 공통','','개발에 필요한 공통 리소스','20221208','20230113','90'),
                                                                                                  ('25','DB설계','데이터베이스 설계','','데이터베이스 설계','20221205','20221230','100'),
                                                                                                  ('25','DB설계','데이터베이스 설계','','화면별 쿼리 작성','20221219','20230130','80'),
                                                                                                  ('25','DB설계','데이터베이스 설계','','화면별 쿼리 검증','20230116','20230130','30');
INSERT INTO REACT.PMSLIST (PMS_NO,DEPTH1,DEPTH2,DEPTH3,PMS_DESC,STRT_DATE,END_DATE,PROC_RATE) VALUES
                                                                                                  ('25','화면개발','홈','','대시보드','20230201','20230210','0'),
                                                                                                  ('25','화면개발','모돈생산성 분석','','모돈 대시보드','20230201','20230210','0'),
                                                                                                  ('25','화면개발','모돈생산성 분석','','총산예측','20230201','20230210','0'),
                                                                                                  ('25','화면개발','모돈생산성 분석','','모돈 개별 생산성','20230201','20230210','0'),
                                                                                                  ('25','화면개발','모돈생산성 분석','','모돈 생산성 취약구간 분석','20230118','20230130','0'),
                                                                                                  ('25','화면개발','모돈생산성 분석','','모돈 생산성 취약구간 결과','20230118','20230130','0'),
                                                                                                  ('25','화면개발','모돈생산성 분석','','모돈 생산성취약구간분석 팝업','20230118','20230130','0'),
                                                                                                  ('25','화면개발','자돈 비육돈 이상징후 분석','','자돈 대시보드','20230109','20230120','100'),
                                                                                                  ('25','화면개발','자돈 비육돈 이상징후 분석','','자돈 돈사돈방 현황','20230109','20230120','100'),
                                                                                                  ('25','화면개발','자돈 비육돈 이상징후 분석','','자돈 돈사돈방 이상징후 분석','20230109','20230120','40');
INSERT INTO REACT.PMSLIST (PMS_NO,DEPTH1,DEPTH2,DEPTH3,PMS_DESC,STRT_DATE,END_DATE,PROC_RATE) VALUES
                                                                                                  ('25','화면개발','자돈 비육돈 이상징후 분석','','자돈 돈사돈방 이상징후 분석(영상)','20230109','20230120','20'),
                                                                                                  ('25','화면개발','자돈 비육돈 이상징후 분석','','비육돈 대시보드','20230125','20230130','0'),
                                                                                                  ('25','화면개발','자돈 비육돈 이상징후 분석','','비육돈 돈사돈방 현황','20230125','20230130','0'),
                                                                                                  ('25','화면개발','자돈 비육돈 이상징후 분석','','비육돈 돈사돈방 이상징후 분석','20230125','20230130','0'),
                                                                                                  ('25','화면개발','자돈 비육돈 이상징후 분석','','비육돈 돈사돈방 이상징후 분석(영상)','20230125','20230130','0'),
                                                                                                  ('25','화면개발','자돈 비육돈 이상징후 분석','','IoT 정보 분석','20230118','20230130','0'),
                                                                                                  ('25','화면개발','적정출하시점 분석','','적정출하시점 분석','20230117','20230120','90'),
                                                                                                  ('25','화면개발','적정출하시점 분석','','출하 두수 예측','20230117','20230120','0'),
                                                                                                  ('25','화면개발','출하동향 패턴분석','','출하 두수 추세','20230109','20230116','90'),
                                                                                                  ('25','화면개발','출하동향 패턴분석','','등급 출현율 추세','20230109','20230116','90');
INSERT INTO REACT.PMSLIST (PMS_NO,DEPTH1,DEPTH2,DEPTH3,PMS_DESC,STRT_DATE,END_DATE,PROC_RATE) VALUES
                                                                                                  ('25','화면개발','출하동향 패턴분석','','등지방 두께 추세','20230109','20230116','90'),
                                                                                                  ('25','화면개발','출하동향 패턴분석','','도체중 추세 추세','20230109','20230116','90'),
                                                                                                  ('25','화면개발','출하동향 패턴분석','','혼합분석','20230127','20230210','20'),
                                                                                                  ('25','화면개발','환경설정','','돈사 설정','20230109','20230117','75'),
                                                                                                  ('25','화면개발','환경설정','','돈방 설정','20230109','20230117','75'),
                                                                                                  ('25','화면개발','환경설정','','돈칸 설정','20230109','20230117','75'),
                                                                                                  ('25','화면개발','환경설정','','카메라설정','20230109','20230117','75');
